# 문제은행

In [1]:
import pandas as pd
import numpy as np

In [2]:
url = ('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/tips.csv')

In [3]:
tips = pd.read_csv(url)
#this df has 'total_bill','tip','sex','smoker','day','time','size' columns

In [63]:
#1. Show all the available information in the tips dataframe
tips[['total_bill','tip','sex','smoker','day','time','size']].head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [64]:
#2. Show me all the available information in the timps dataframe, where the time is dinner 
tips[tips['time'] == 'Dinner'].head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [61]:
#3. Show me all the available information in the timps dataframe, 
# where tip amount is more than $5 and when the time is dinner
# interestingly, if you exchange & with 'and', it will give an error
tips[(tips['tip']>5) & (tips['time']=='Dinner')].head(5)

    total_bill   tip     sex smoker  day    time  size
23       39.42  7.58    Male     No  Sat  Dinner     4
44       30.40  5.60    Male     No  Sun  Dinner     4
47       32.40  6.00    Male     No  Sun  Dinner     4
52       34.81  5.20  Female     No  Sun  Dinner     4
59       48.27  6.73    Male     No  Sat  Dinner     4

In [60]:
#4. Show me everything where size of the parties at least 5 OR total bill was more than $45
tips[(tips['size']>=5)|(tips['total_bill']>45)].head(5)

     total_bill   tip     sex smoker   day    time  size
59        48.27  6.73    Male     No   Sat  Dinner     4
125       29.80  4.20  Female     No  Thur   Lunch     6
141       34.30  6.70    Male     No  Thur   Lunch     6
142       41.19  5.00    Male     No  Thur   Lunch     5
143       27.05  5.00  Female     No  Thur   Lunch     6

In [28]:
frame = pd.DataFrame({'col1':['A','B',np.NaN,'C','D'],
                      'col2':['F',np.NaN,'G','H','I']})

In [59]:
#5. check null values in col2
frame[frame['col2'].isnull()]

  col1 col2
1    B  NaN

In [58]:
#6. check not null values in col1
frame[frame['col1'].notnull()]

  col1 col2
0    A    F
1    B  NaN
3    C    H
4    D    I

In [57]:
#7. From the tips, get the number of tips by sex
tips.groupby('sex').agg({'tip':np.size})

          tip
sex
Female   87.0
Male    157.0

In [56]:
#8. See how tip amount differs by the day of the week 
test = tips.groupby('day').agg({'tip':np.mean,'day':np.size})

In [43]:
#test.rename(columns={'tip':"tip.avg",'day':'numberOfDays'})

In [55]:
#9. See how tip amount differs by smoker & day 
tips.groupby(['smoker','day']).agg({'tip':np.mean})

                  tip
smoker day
No     Fri   2.812500
       Sat   3.102889
       Sun   3.167895
       Thur  2.673778
Yes    Fri   2.714000
       Sat   2.875476
       Sun   3.516842
       Thur  3.030000

In [49]:
df1 = pd.DataFrame({'key':['A','B','C','D'],
                   'value':np.random.randn(4)})
df2 = pd.DataFrame({'key':['B','D','D','E'],
                   'value':np.random.randn(4)})

In [54]:
#10. Perform inner join of df1 and df2
pd.merge(df1,df2,on='key')

  key   value_x   value_y
0   B -1.531375 -0.413673
1   D -0.494315 -0.883633
2   D -0.494315  0.070973

In [53]:
#11. show all records from df1 
pd.merge(df1,df2,how='left',on='key')

  key   value_x   value_y
0   A -0.189650       NaN
1   B -1.531375 -0.413673
2   C -0.524882       NaN
3   D -0.494315 -0.883633
4   D -0.494315  0.070973

In [65]:
#12. Show all records from df2
pd.merge(df1,df2,how='right',on='key')

  key   value_x   value_y
0   B -1.531375 -0.413673
1   D -0.494315 -0.883633
2   D -0.494315  0.070973
3   E       NaN  1.233485

In [66]:
#13. Show all records from both
pd.merge(df1,df2,how='outer',on='key')

  key   value_x   value_y
0   A -0.189650       NaN
1   B -1.531375 -0.413673
2   C -0.524882       NaN
3   D -0.494315 -0.883633
4   D -0.494315  0.070973
5   E       NaN  1.233485

In [69]:
#14. Show all records from both without duplicates
pd.concat([df1,df2]).drop_duplicates()

  key     value
0   A -0.189650
1   B -1.531375
2   C -0.524882
3   D -0.494315
0   B -0.413673
1   D -0.883633
2   D  0.070973
3   E  1.233485

In [70]:
friend_request = pd.DataFrame({'sender_id':[1,1,1,2,3],
                               'send_to_id':[2,3,4,3,4],
                               'request_date':['2016_06-01','2016_06-01','2016_06-01','2016_06-02','2016_06-09']})

request_accepted = pd.DataFrame({'requester_id':[1,1,2,3,3],
                                 'accepter_id':[2,3,3,4,4],
                                 'accept_date':['2016_06-03','2016_06-08','2016_06-08','2016_06-09','2016_06-10']})

In [71]:
#15. how would you go about finding the overall acceptance rate of requests rounded to 2 decimals, 
#which is the number of acceptance divide the number of requests?

#stackoverflow: https://stackoverflow.com/questions/55841616/solving-sql-problem-using-pandas-from-the-given-pandas-dataframe-find-the-ove

numerator = len(request_accepted.groupby(['requester_id', 'accepter_id']))
denominator = len(friend_request.groupby(['sender_id', 'send_to_id']))

print('{:.2f}'.format(round(numerator/denominator, 2)) if numerator/denominator else 0)

0.80

In [72]:
log = pd.DataFrame(
            {"date":['2016-6-1', '2016-9-22', '2016-10-28', '2016-11-4', '2016-6-29', '2016-10-1', '2016-6-15', '2016-7-29', '2016-11-1'],
             "student_id":[1, 2, 3, 4, 5, 6, 7, 8, 9]
            })
students = pd.DataFrame(
            {"date_of_birth":['1988-6-1', '1987-9-22', '1988-10-27', '1986-11-3', '1987-6-29', '1988-10-2', '1988-6-16', '1988-7-28', '1988-11-2'],
             "student_id":[1, 2, 3, 4, 5, 6, 7, 8, 9]
            })

In [73]:
#16.Find the percent of students attend school on their birthday
# stackoverflow: https://stackoverflow.com/questions/55803986/find-the-rows-that-have-same-month-day-values-as-the-other-rows-using-pandas
merged_df = log.merge(students, on='student_id')
merged_df['date'] = pd.to_datetime(merged_df['date'])
merged_df['date_of_birth'] = pd.to_datetime(merged_df['date_of_birth'])

print(((merged_df['date'].dt.month.eq(merged_df['date_of_birth'].dt.month))& (merged_df['date'].dt.day.eq(merged_df['date_of_birth'].dt.day))).mean())

0.3333333333333333

In [75]:
salary = pd.DataFrame({'ID':[1,2,3],
                      'Salary':[100,200,300]})

In [84]:
#17. Write a query to get the second highest salary from the Employee table.
salary['Salary'].nlargest(2)[1]
#why wouldn't .nlargest(2)[0] not work?

200

In [32]:
#18. Write a SQL query to get the nth highest salary from the Employee table.
#Create a function

In [33]:
Customers = pd.DataFrame({'ID':[1,2,3,4],
                         'Name':['Joe','Henry','Sam','Max']})
Orders = pd.DataFrame({'ID':[1,2],
                      'CustomerId':[3,1]})

In [34]:
#19. Write a SQL query to find all customers who never order anything.

In [85]:
request_accepted_short = pd.DataFrame({'requester_id':[1,1,2,3],
                                 'accepter_id':[2,3,3,4],
                                 'accept_date':['2016_06-03','2016_06-08','2016_06-08','2016_06-09']})

In [87]:
#20. find the the people who has most friends and the most friends number
#stackoverflow: https://stackoverflow.com/questions/55896806/solving-sql-problem-using-pandas-from-the-given-pandas-df-find-the-person-wit
pd.concat([request_accepted_short['requester_id'],request_accepted_short['accepter_id']]).value_counts()

3    3
2    2
1    2
4    1
dtype: int64

In [44]:
Employee = pd.DataFrame({'Id':[1,2,3,4,5,6,7],
                        'Name':['Joe','Henry','Sam','Max','Janet','Randy','Will'],
                        'Salary':[85000,80000,60000,90000,69000,85000,70000],
                        'DepartmentId':[1,2,2,1,1,1,1]
                        })
Department = pd.DataFrame({'Id':[1,2],
                          'Name':['IT','Sales']
                          })

In [45]:
#21. Find employees who earn the top three salaries in each of the department.